{
  "site": {
    "title": "Danny's Portfolio"
  },
  "nav": {
    "home": "Home",
    "about": "About",
    "resume": "Resume",
    "portfolio": "Portfolio",
    "contact": "Contact"
  },
  "footer_template":{
    "copyright": "© Copyright Danny Alfandi. All Rights Reserved.",
    "designed": "Designed by ",
    "bootstrap_made": "BootstrapMade.",
    "distributed": "Distributed by ",
    "theme_wagon": "ThemeWagon."
  },
  "home_page": {
    "description": "He's a backend/full-stack developer",
    "about_me": "About Me"
  },
  "about_page": {
    "about": "About",
    "content_about_1": "Danny is a 3+ years experienced Full-Stack Engineer with experience in designing and delivering backend services and mobile applications.",
    "content_about_2": "He graduated from the University of Surabaya (UBAYA) in 2020 and began his career as a software-house. First he was a software developer at Hiro Solutions. After that, he continued his journey as a Backend Developer at one of the leading digital agencies and Magento partners globally, ICUBE by SIRCLO in Jakarta, in mid-2021 and served many brands. Last his journey as Full-Stack Developer at PT Inaugurasi Pelangi Nusantara in Surabaya.",
    "content_about_3": "He started his journey in 2020 and has continued to improve his skills to deliver real products.",
    "role": "Software Developer",
    "bio": "Bio",
    "phone": "Phone",
    "email": "Email",
    "freelance": "Freelance",
    "status_work": "Available",
    "city": "City",
    "location": "Surabaya, East Java",
    "degree": "Degree",
    "status_degree": "Bachelor’s Degree",
    "skills": "Skills",
    "content_skills": "These are my soft skills and hard skills that I have."
  },
  "location":{
    "surabaya": "Surabaya, East Java",
    "tangerang": "Tangerang",
    "jakarta": "Jakarta",
    "indonesia": "Indonesia",
    "remote": "Remote"
  },
  "resume_page": {
    "resume": "Resume",
    "content_resume": "Software Developer with 3+ years of full-stack and backend development experience, delivering scalable and maintainable systems that enhance business performance. Skilled in PHP (Laravel), JavaScript (Node.js, GraphQL), Flutter, and DevOps tools (Docker, Git). Streamlining codebases, reducing technical debt, and deploying containerized environments for frictionless operations. Passionate about leveraging software engineering and data-driven insights to develop impactful, high-performance solutions. Currently seeking opportunities as a Full-Stack Developer or to transition into Data Science.",
    "education": "Education",
    "system": "Bachelor’s Degree in Information Systems (GPA 3.632/4.0)",
    "year": "06/2016 - 12/2020",
    "university": "University of Surabaya (UBAYA)",
    "prof_experience": "Professional Experience",
    "fullstack_dev": "Fullstack Developer",
    "software_engineer": "Software Engineer",
    "software_backend_dev": "Software Backend Developer",
    "mobile_app_freelance": "Mobile App Freelancer",
    "software_house": "Software House",
    "content_work_4": ["Migrated Aquila codebase to Laravel to reduce new developers' learning curve as well as make data structures and models easier to maintain for future analytics integrations.","Reviewed and refactored colleagues' code to maintain quality standards and provide maintainable, optimal solutions, adopting the same optimization technique used on data systems and pipeline performance optimization.","Developed a custom Composer package to group common functions and best practices, reducing duplicated code, enabled modular, reusable components to reproducible workflows."],
    "content_work_3": ["Developed a mobile order monitoring application for business owners using Flutter, improving real-time tracking of sales and customer data through data-based dashboards and analytics visualization. This includes an API exposed by the other teams.","Integrated geolocation features, which enable businesses to visualize customer distribution through interactive maps, allowing spatial data analysis and visualization for business decision-making. This allows users to see who is utilizing this product.","Enhanced order management with a systematic status system (pending, processing, shipped, received) to reduce operational inefficiencies and track performance tracking through organized process data.","Developed a dynamic leaderboard system to track high-performing products, customers, and products to deliver actionable performance data and data trends for decision-making."],
    "content_work_2": ["Shipped multiple production e-commerce sites and releases, collaborating with seniors to implement and override core platform functions in Magento 2, contributing clean data structures and horizontally logic suitable for analytics consumption.","Implemented and integrated GraphQL APIs (custom queries/mutations) and managed third-party REST/GraphQL services consumed by brand storefronts, focusing on rapid data retrieval and structured access for analytics and reporting.","Deployed three sites to production, which offered on-time deployments, successful post-launch support, and clean version updates, maintaining consistent data integrity for performance monitoring and insight generation.","Containerized Docker-based applications to assist in the standardization of deployments, reducing environment drift, and deployment failures.","Integrated and automated end-to-end processes with n8n for automating data syncs, notifications, and ETL processes, gaining core experience with data-pipeline automation and transformation workflows."],
    "content_work_1": ["Collaborated with the engineering and UI/UX teams in developing in-house web applications using PHP, facilitating improved team productivity and streamlined processes.","Developed a competition workflow mobile application with Flutter."]
  },
  "contact_page":{
    "contact": "Contact Me",
    "description": "Feel free to reach out for any inquiries or collaborations.",
    "address": "Address",
    "whatsapp": "WhatsApp Number",
    "email_me": "Email Me"
  },
  "portfolio_page": {
    "all": "All",
    "mobile_app": "Mobile App",
    "web_app": "Web App",
    "data_science": "Data Science",
    "portfolio": "Portfolio",
    "more_details": "More Details",
    "description": "This is Danny Alfandi's portfolio from his previous work, freelance projects, and personal projects/classes. You can view the details by clicking the icon link when hovering over the image."
  },
  "detail_portfolio_page": {
    "portfolio_details": "Portfolio Details",
    "project_information": "Project Information",
    "category": "Category",
    "client": "Client",
    "project_date": "Project Date",
    "description": "Description",
    "specification": "Specification"
  }
}