{
  "site": {
    "title": "Danny's Portfolio"
  },
  "nav": {
    "home": "Home",
    "about": "About",
    "resume": "Resume",
    "portfolio": "Portfolio",
    "contact": "Contact"
  },
  "footer_template":{
    "copyright": "© Copyright Danny Alfandi. All Rights Reserved.",
    "designed": "Designed by ",
    "bootstrap_made": "BootstrapMade.",
    "distributed": "Distributed by ",
    "theme_wagon": "ThemeWagon."
  },
  "home_page": {
    "description": "He's a backend/full-stack developer",
    "about_me": "About Me"
  },
  "about_page": {
    "about": "About",
    "content_about_1": "Danny is a 3+ years experienced Full-Stack Engineer with experience in designing and delivering backend services and mobile applications.",
    "content_about_2": "He graduated from the University of Surabaya (UBAYA) in 2020 and began his career as a software-house. First he was a software developer at Hiro Solutions. After that, he continued his journey as a Backend Developer at one of the leading digital agencies and Magento partners globally, ICUBE by SIRCLO in Jakarta, in mid-2021 and served many brands. Last his journey as Full-Stack Developer at PT Inaugurasi Pelangi Nusantara in Surabaya.",
    "content_about_3": "He started his journey in 2020 and has continued to improve his skills to deliver real products.",
    "role": "Software Developer",
    "bio": "Bio",
    "phone": "Phone",
    "email": "Email",
    "freelance": "Freelance",
    "status_work": "Available",
    "city": "City",
    "location": "Surabaya, East Java",
    "degree": "Degree",
    "status_degree": "Bachelor’s Degree",
    "skills": "Skills",
    "content_skills": "These are my soft skills and hard skills that I have."
  },
  "location":{
    "surabaya": "Surabaya, East Java",
    "tangerang": "Tangerang",
    "jakarta": "Jakarta",
    "indonesia": "Indonesia",
    "remote": "Remote"
  },
  "resume_page": {
    "resume": "Resume",
    "content_resume": "Software Developer with extensive experience in full-stack and backend development, specializing in Laravel, Magento 2, and Flutter. Demonstrated success in optimizing codebases and deploying containerized environments, resulting in improved operational efficiency. Committed to utilizing data-driven insights to develop impactful software solutions. Open to opportunities in Full-Stack Development with a focus on transitioning into Data Science.",
    "education": "Education",
    "certifications": "Certifications",
    "system": "Bachelor’s Degree in Information Systems (GPA 3.632/4.0)",
    "year": "06/2016 - 01/2021",
    "issue": "Issued",
    "expired": "Expired",
    "node_certification": "Oct 2024",
    "ai_engineer_issue": "Jul 2025",
    "dasar_ai_issue": "Oct 2025",
    "dasar_ai_expired": "Oct 2028",
    "click_here_to_download": "Click here to download",
    "university": "University of Surabaya (UBAYA)",
    "prof_experience": "Professional Experience",
    "fullstack_dev": "Fullstack Developer",
    "software_engineer": "Software Engineer",
    "software_backend_dev": "Software Backend Developer",
    "mobile_app_freelance": "Mobile App Freelancer",
    "software_house": "Software House",
    "content_work_4": ["Migrated and optimized legacy codebase to Laravel, improving maintainability and reducing onboarding time by 20%.","Refactored team code with profiling tools and clean architecture, achieving a 10% reduction in code smells.","Developed reusable Composer package for shared business logic, eliminating duplicate code and accelerating feature delivery.","Applied data-system optimization techniques to streamline query execution and caching, enhancing response times and reducing server resource usage."],
    "content_work_3": ["Developed mobile order monitoring application using Flutter to enhance real-time sales tracking.","Integrated geolocation features for visualizing customer distribution via interactive maps.","Implemented systematic status system for order management, reducing operational inefficiencies.","Created dynamic leaderboard system to identify high-performing products and customers."],
    "content_work_2": ["Launched multiple e-commerce platforms using Magento 2, streamlining core storefront functions.","Optimized GraphQL APIs to enhance data retrieval efficiency, decreasing client-side requests by 25%.","Deployed three production sites with zero critical post-launch issues, ensuring seamless version upgrades.","Containerized service components with Docker to standardize environments and minimize deployment inconsistencies.","Integrated and automated end-to-end processes with n8n for automating data syncs."],
    "content_work_1": ["Collaborated with engineering and UI/UX teams to develop in-house web applications using PHP.","Designed competition workflow mobile application utilizing Flutter.","Enhanced team productivity and streamlined processes through effective collaboration."]
  },
  "contact_page":{
    "contact": "Contact Me",
    "description": "Feel free to reach out for any inquiries or collaborations.",
    "address": "Address",
    "whatsapp": "WhatsApp Number",
    "email_me": "Email Me"
  },
  "portfolio_page": {
    "all": "All",
    "mobile_app": "Mobile App",
    "web_app": "Web App",
    "data_science": "Data Science",
    "portfolio": "Portfolio",
    "more_details": "More Details",
    "description": "This is Danny Alfandi's portfolio from his previous work, freelance projects, and personal projects/classes. You can view the details by clicking the icon link when hovering over the image."
  },
  "detail_portfolio_page": {
    "portfolio_details": "Portfolio Details",
    "project_information": "Project Information",
    "category": "Category",
    "client": "Client",
    "project_date": "Project Date",
    "description": "Description",
    "specification": "Specification"
  }
}