{
  "site": {
    "title": "Danny's Portfolio"
  },
  "nav": {
    "home": "Home",
    "about": "About",
    "resume": "Resume",
    "portfolio": "Portfolio",
    "contact": "Contact"
  },
  "footer_template":{
    "copyright": "© Copyright Danny Alfandi. All Rights Reserved.",
    "designed": "Designed by ",
    "bootstrap_made": "BootstrapMade.",
    "distributed": "Distributed by ",
    "theme_wagon": "ThemeWagon."
  },
  "home_page": {
    "description": "He's a backend/full-stack developer",
    "about_me": "About Me"
  },
  "about_page": {
    "about": "About",
    "content_about_1": "Danny is a Full-Stack Engineer with 3+ years of experience designing and delivering backend services and mobile applications.",
    "content_about_2": "He graduated from the University of Surabaya (UBAYA) in 2020 and began his career in the software-house industry. In mid-2021, he joined ICUBE by SIRCLO in Jakarta as a Backend Developer at a leading digital agency and global Magento partner, supporting many brands. He also worked as a Full-Stack Developer at PT Inaugurasi Pelangi Nusantara in Surabaya.",
    "content_about_3": "He started this journey in 2020 and has continually improved his skills to deliver real products.",
    "role": "Software Developer",
    "bio": "Bio",
    "phone": "Phone",
    "email": "Email",
    "freelance": "Freelance",
    "status_work": "Available",
    "city": "City",
    "location": "Surabaya, East Java",
    "degree": "Degree",
    "status_degree": "Bachelor’s Degree",
    "skills": "Skills",
    "content_skills": "These are my soft skills and hard skills that I have."
  },
  "location":{
    "surabaya": "Surabaya, East Java",
    "tangerang": "Tangerang",
    "jakarta": "Jakarta",
    "indonesia": "Indonesia",
    "remote": "Remote"
  },
  "resume_page": {
    "resume": "Resume",
    "content_resume": "Software Developer with over 3 years of experience specializing in backend and full-stack development. Optimized codebase performance, ensured maintainability, and implemented containerized environments to enhance operational efficiency. Proficient in PHP (Laravel), JavaScript (Node.js, GraphQL), Flutter, and DevOps tools (Docker and Git). Demonstrated ability to deliver optimal solutions that enhance user experience and improve operational efficiency.",
    "education": "Education",
    "system": "Bachelor’s Degree in Information Systems (GPA 3.632/4.0)",
    "year": "06/2016 - 12/2020",
    "university": "University of Surabaya (UBAYA)",
    "prof_experience": "Professional Experience",
    "fullstack_dev": "Fullstack Developer",
    "software_engineer": "Software Engineer",
    "software_backend_dev": "Software Backend Developer",
    "mobile_app_freelance": "Mobile App Freelancer",
    "software_house": "Software House",
    "content_work_4": ["Migrated customized codebase from Aquila to Laravel, streamlining the learning curve for new developers.","Reviewed and optimized teammates' code to uphold quality standards and ensure maintainable, performant solutions.","Developed a custom Composer package to centralize shared functions and standards, cutting duplicate code and speeding up feature delivery across similar projects."],
    "content_work_3": ["Developed a mobile order monitoring application for business owners using Flutter, improving real-time tracking of sales and customer insights. This consumes an API provided by the other teams.","Integrated geolocation features, allowing businesses to visualize customer distribution via interactive maps. This enables users to identify who is utilizing this product.","Optimized order management with a categorized status system (pending, processing, shipped, received), reducing operational inefficiencies.","Developed a dynamic leaderboard system to track top-performing products, customers, and employees, boosting engagement and performance analysis."],
    "content_work_2": ["Shipped multiple production e-commerce sites and releases, collaborating with seniors to implement and override core platform functions in magento 2.","Built and integrated GraphQL APIs (custom queries/mutations) and orchestrated third-party REST/GraphQL services used by brand storefronts.","Deployed three websites to production, releases and smooth updates.","Containerized services with Docker to standardize deployments, reducing environment drift and deployment issues.","Integrated and automated end-to-end workflows using n8n to orchestrate data syncs, notifications, and ETL tasks."],
    "content_work_1": ["Collaborated with engineering and UI/UX teams to develop internal web tools using PHP, contributing to improved team efficiency and streamlined workflows.","Developed a competition workflow app in Flutter."]
  },
  "contact_page":{
    "contact": "Contact Me",
    "description": "Feel free to reach out for any inquiries or collaborations.",
    "address": "Address",
    "whatsapp": "WhatsApp Number",
    "email_me": "Email Me"
  },
  "portfolio_page": {
    "all": "All",
    "mobile_app": "Mobile App",
    "web_app": "Web App",
    "data_science": "Data Science",
    "portfolio": "Portfolio",
    "more_details": "More Details",
    "description": "This is Danny Alfandi's portfolio from his previous work, freelance projects, and personal projects/classes. You can view the details by clicking the icon link when hovering over the image."
  },
  "detail_portfolio_page": {
    "portfolio_details": "Portfolio Details",
    "project_information": "Project Information",
    "category": "Category",
    "client": "Client",
    "project_date": "Project Date"
  }
}