{
  "portfolio": {
    "undefined": {
      "project_name": "Freelite Monemy",
      "highlight": "highlight 7"
    },
    "bbp": {
      "project_name": "BBP (Courier Tracking)",
      "highlight": "Android barcode scan & courier tracking."
    },
    "charicedecoratie": {
      "project_name": "Charicedecoratie (Management App)",
      "highlight": "End‑to‑end event management app (booking→payment→ops).",
      "description": "Developing an app to automate Charicedecoratie's entire business process—from package booking (date/time conflict check, package-type dynamic forms), payment with transfer receipt and automatic cancel when deadline exceeded, to rescheduling with rules (only valid if paid and 2+ days in advance). On the operational front, admins get reminders for events, are able to assign freelancers/PICs, perform monthly stock counts, record outbound notes, and monitor auto depreciation of assets by useful life. There's a statistics dashboard: favorite package charts, monthly/yearly income & expense views, and change history for audit purposes. Google Place integration facilitates easy entry of event locations."
    },
    "msglow": {
      "highlight": "Flutter analytics app with dashboards, leaderboards, and geolocation."
    },
    "ayugold": {
      "project_name": "Ayugold (Jewelry)",
      "highlight": "Custom after-quote logic, BPMN flow design support, and forgot-password redirect fix using Magento 2."
    },
    "nickscali": {
      "highlight": "Furniture e‑commerce storefront with PLP/PDP flows and GraphQL integrations; release-ready features and smoother deployments."
    },
    "alwayshappi": {
      "project_name": "Alwayshappi (Baby & children's clothing store)",
      "highlight": "Shopware storefront improvements, Excel import to DB, custom footer, and N8N integration."
    },
    "biofarma": {
      "project_name": "Biofarma (Life Science)",
      "highlight": "Secure GraphQL + storefront/admin features; faster APIs and smoother ops."
    },
    "sakafarma": {
      "highlight": "Pharmacy e-commerce storefront with searchable catalog, product detail, and order flows; admin tools for safer releases."
    },
    "sinarmasapp": {
      "project_name": "Sinarmasapp (Magento 2)",
      "highlight": "XML export and GraphQL additions for production date, reviews/ratings, form labels, and spec forms."
    },
    "hotel-at-home": {
      "highlight": "Storefront modules and admin tools for a home‑hotel retail experience; improved product discovery and streamlined checkout."
    },
    "samsonite": {
      "project_name": "Samsonite (Laravel)",
      "highlight": "Laravel-based Excel import for products & prices with detailed import history logs."
    },
    "lnj-logistic": {
      "project_name": "LNJ Logistic (ERP)",
      "highlight": "Warehouse & logistics web app—tracks inbound/outbound, inventory, and delivery documents with role-based controls."
    },
    "natours": {
      "project_name": "Natours (travel)",
      "highlight": "Travel/tour booking app with map-based tour views, secure auth, Stripe checkout, and user reviews."
    },
    "airquality-meteorology": {
      "project_name": "Air Quality Prediction (Meteorology)",
      "highlight": "Predicted target PM2.5 and PM10 with NO₂/SO₂/O₃/CO from weather features using Linear Regression/Gradient Boosting Regressor/Random Forest Regressor with cross-validation; best model reached MAE≈0.010 and MSE≈0.082 (scaled)."
    },
    "air-quality-meteorology": {
      "category_project": "Data Science",
      "project_from": "Bootcamp Final Project",
      "project_date": "June 2025",
      "project_name": "Air Quality Prediction (Meteorology)",
      "description": "Explored pollutant–weather correlations using heatmaps and distributions; performed preprocessing using imputation, scaling, and one-hot encoding. Trained Linear Regression, SVR, Random Forest, Gradient Boosting, and LightGBM using GridSearchCV and cross-validation. Evaluated using R²/MAE/MSE/RMSE and checked over/underfitting using train vs. validation errors comparison; visualized results in clean tables/plots.",
      "specifications": {
        "0": "Preprocessing",
        "1": "Modeling",
        "2": "Evaluation & Robustness"
      }
    }
  }
}