{
  "site": {
    "title": "Portofolio Danny"
  },
  "nav": {
    "home": "Beranda",
    "about": "Tentang",
    "resume": "Resume",
    "portfolio": "Portofolio",
    "contact": "Kontak"
  },
  "footer_template":{
    "copyright": "© Hak Cipta Danny Alfandi. Seluruh hak dilindungi.",
    "designed": "Dirancang oleh ",
    "bootstrap_made": "BootstrapMade.",
    "distributed": "Didistribusikan oleh ",
    "theme_wagon": "ThemeWagon."
  },
  "home_page": {
    "description": "Dia adalah pengembang backend/full-stack.",
    "about_me": "Profil Saya"
  },
  "about_page": {
      "about": "Tentang",
      "content_about_1": "Danny adalah Full-Stack Engineer dengan pengalaman lebih dari 3 tahun dalam merancang dan membangun layanan backend serta aplikasi mobile.",
      "content_about_2": "Ia lulus dari Universitas Surabaya (UBAYA) pada 2020 dan memulai karier di industri software house. Pertama kali bekerja sebagai Software Developer di Hiro Solutions. Setelah itu, ia melanjutkan sebagai Backend Developer di salah satu agensi digital terkemuka dan partner Magento global, ICUBE by SIRCLO di Jakarta, pada pertengahan 2021 dan menangani banyak brand. Terakhir, ia bekerja sebagai Full-Stack Developer di PT Inaugurasi Pelangi Nusantara di Surabaya.",
      "content_about_3": "Ia memulai perjalanan ini pada 2020 dan terus meningkatkan keterampilannya untuk menghadirkan produk nyata.",
      "role": "Pengembang Perangkat Lunak",
      "bio": "Biodata",
      "phone": "Telepon",
      "email": "Email",
      "freelance": "Freelance",
      "status_work": "Tersedia",
      "city": "Kota",
      "location": "Surabaya, Jawa Timur",
      "degree": "Gelar",
      "status_degree": "Gelar Sarjana",
      "skills": "Keahlian",
      "content_skills": "Berikut soft skill dan hard skill yang saya miliki."
    },
    "location": {
      "surabaya": "Surabaya, Jawa Timur",
      "tangerang": "Tangerang",
      "jakarta": "Jakarta",
      "indonesia": "Indonesia",
      "remote": "Jarak Jauh"
    },
    "resume_page": {
      "resume": "Resume",
      "content_resume": "Software Developer dengan pengalaman lebih dari 3 tahun dalam pengembangan full-stack dan backend, mengembangkan sistem yang skalabel dan mudah dirawat untuk meningkatkan kinerja bisnis. Terampil dalam PHP (Laravel), JavaScript (Node.js, GraphQL), Flutter, dan alat DevOps (Docker, Git). Mengoptimalkan basis kode, mengurangi utang teknis, dan menerapkan lingkungan terkontainerisasi untuk operasi yang lebih efisien. Memiliki semangat dalam memanfaatkan rekayasa perangkat lunak dan wawasan berbasis data untuk mengembangkan solusi berdampak dan berkinerja tinggi. Saat ini mencari peluang sebagai Full-Stack Developer atau beralih ke bidang Data Science.",
      "education": "Pendidikan",
      "system": "Gelar Sarjana Sistem Informasi (IPK 3,632/4,0)",
      "year": "06/2016 - 12/2020",
      "university": "Universitas Surabaya (UBAYA)",
      "prof_experience": "Pengalaman Profesional",
      "fullstack_dev": "Fullstack Developer",
      "software_engineer": "Software Engineer",
      "software_backend_dev": "Software Backend Developer",
      "mobile_app_freelance": "Freelancer Aplikasi Mobile",
      "software_house": "Software House",
      "content_work_4": [
        "Memigrasikan kode dasar Aquila ke Laravel untuk mengurangi kurva pembelajaran bagi pengembang baru serta memudahkan pemeliharaan struktur data dan model untuk integrasi analitik di masa depan.",
        "Meninjau dan merombak kode rekan kerja untuk menjaga standar kualitas dan memberikan solusi yang optimal dan mudah dipelihara, dengan mengadopsi teknik optimasi yang sama seperti yang digunakan pada sistem data dan pipeline performa.",
        "Mengembangkan paket Composer kustom untuk mengelompokkan fungsi umum dan praktik terbaik, mengurangi duplikasi kode, serta memungkinkan komponen modular dan alur kerja yang dapat digunakan kembali."
      ],
      "content_work_3": [
        "Mengembangkan aplikasi pemantauan pesanan mobile untuk pemilik bisnis menggunakan Flutter, meningkatkan pelacakan penjualan dan data pelanggan secara real-time melalui dasbor dan visualisasi analitik berbasis data. Termasuk API yang disediakan oleh tim lain.",
        "Mengintegrasikan fitur geolokasi yang memungkinkan bisnis memvisualisasikan distribusi pelanggan melalui peta interaktif, memungkinkan analisis dan visualisasi data spasial untuk pengambilan keputusan bisnis. Hal ini memungkinkan pengguna melihat siapa yang menggunakan produk ini.",
        "Meningkatkan manajemen pesanan dengan sistem status yang terstruktur (pending, processing, shipped, received) untuk mengurangi ketidakefisienan operasional dan melacak kinerja melalui data proses yang terorganisir.",
        "Mengembangkan sistem leaderboard dinamis untuk melacak produk dan pelanggan berperforma tinggi guna menghasilkan data kinerja yang dapat ditindaklanjuti dan tren data untuk pengambilan keputusan."
      ],
      "content_work_2": [
        "Meluncurkan beberapa situs e-commerce produksi dan rilisnya, bekerja sama dengan senior untuk mengimplementasikan dan menyesuaikan fungsi inti platform di Magento 2, serta berkontribusi pada struktur data yang bersih dan logika horizontal yang mendukung konsumsi analitik.",
        "Mengimplementasikan dan mengintegrasikan GraphQL API (query/mutation kustom) serta mengelola layanan REST/GraphQL pihak ketiga yang digunakan oleh brand storefront, dengan fokus pada pengambilan data yang cepat dan terstruktur untuk analitik dan pelaporan.",
        "Merilis tiga situs ke produksi dengan peluncuran tepat waktu, dukungan pasca rilis yang berhasil, dan pembaruan versi yang bersih, menjaga integritas data yang konsisten untuk pemantauan kinerja dan pembuatan wawasan.",
        "Mengkonteinerisasi aplikasi berbasis Docker untuk membantu standarisasi deployment, mengurangi perbedaan lingkungan, dan meminimalkan kegagalan deployment.",
        "Mengintegrasikan dan mengotomatisasi proses ujung-ke-ujung menggunakan n8n untuk sinkronisasi data, notifikasi, dan proses ETL, memperoleh pengalaman inti dalam otomasi pipeline data dan alur transformasi."
      ],
      "content_work_1": [
        "Berkolaborasi dengan tim engineering dan UI/UX dalam mengembangkan aplikasi web internal menggunakan PHP, meningkatkan produktivitas tim dan efisiensi proses.",
        "Mengembangkan aplikasi mobile alur kompetisi menggunakan Flutter."
      ]
  },
  "contact_page": {
    "contact": "Hubungi Saya",
    "description": "Jangan ragu untuk menghubungi saya untuk pertanyaan atau kolaborasi.",
    "address": "Alamat",
    "whatsapp": "Nomor WhatsApp",
    "email_me": "Kirim Email"
  },
  "portfolio_page": {
    "all": "Semua",
    "mobile_app": "Aplikasi Mobile",
    "web_app": "Aplikasi Web",
    "data_science": "Data Science",
    "portfolio": "Portofolio",
    "more_details": "Lihat Detail",
    "description": "Ini adalah portofolio Danny Alfandi yang memuat pekerjaan sebelumnya, proyek freelance, serta proyek/kelas pribadi. Anda dapat melihat detailnya dengan mengeklik ikon tautan saat kursor diarahkan ke gambar."
  },
  "detail_portfolio_page": {
    "portfolio_details": "Detail Portofolio",
    "project_information": "Informasi Proyek",
    "category": "Kategori",
    "client": "Klien",
    "project_date": "Tanggal Proyek",
    "description": "Deskripsi",
    "specification": "Spesifikasi"
  }
}