{
  "site": {
    "title": "Portofolio Danny"
  },
  "nav": {
    "home": "Beranda",
    "about": "Tentang",
    "resume": "Resume",
    "portfolio": "Portofolio",
    "contact": "Kontak"
  },
  "footer_template":{
    "copyright": "© Hak Cipta Danny Alfandi. Seluruh hak dilindungi.",
    "designed": "Dirancang oleh ",
    "bootstrap_made": "BootstrapMade.",
    "distributed": "Didistribusikan oleh ",
    "theme_wagon": "ThemeWagon."
  },
  "home_page": {
    "description": "Dia adalah pengembang backend/full-stack.",
    "about_me": "Profil Saya"
  },
  "about_page": {
    "about": "Tentang",
    "content_about_1": "Danny adalah Full-Stack Engineer dengan pengalaman lebih dari 3 tahun dalam merancang dan membangun layanan backend serta aplikasi mobile.",
    "content_about_2": "Lulus dari Universitas Surabaya (UBAYA) pada 2020 dan memulai karier di industri software house. Pada pertengahan 2021, ia bergabung dengan ICUBE by SIRCLO di Jakarta sebagai Backend Developer pada agensi digital terkemuka dan partner global Magento yang mendukung banyak brand. Ia juga pernah bekerja sebagai Full-Stack Developer di PT Inaugurasi Pelangi Nusantara di Surabaya.",
    "content_about_3": "Ia memulai perjalanan ini pada 2020 dan terus meningkatkan keterampilannya untuk menghadirkan produk nyata.",
    "role": "Pengembang Perangkat Lunak",
    "bio": "Biodata",
    "phone": "Telepon",
    "email": "Email",
    "freelance": "Freelance",
    "status_work": "Tersedia",
    "city": "Kota",
    "location": "Surabaya, Jawa Timur",
    "degree": "Gelar",
    "status_degree": "Sarjana (S1)",
    "skills": "Keahlian",
    "content_skills": "Berikut adalah soft skill dan hard skill saya."
  },
  "location": {
    "surabaya": "Surabaya, Jawa Timur",
    "tangerang": "Tangerang",
    "jakarta": "Jakarta",
    "indonesia": "Indonesia",
    "remote": "Jarak Jauh"
  },
  "resume_page": {
    "resume": "Resume",
    "content_resume": "Software Developer dengan pengalaman lebih dari 3 tahun yang mengkhususkan diri pada pengembangan backend dan full-stack. Mengoptimalkan performa codebase, memastikan maintainability, dan menerapkan lingkungan terkontainer untuk meningkatkan efisiensi operasional. Mahir PHP (Laravel), JavaScript (Node.js, GraphQL), Flutter, serta alat DevOps (Docker dan Git). Terbukti mampu menghadirkan solusi optimal yang meningkatkan pengalaman pengguna dan efisiensi operasional.",
    "education": "Pendidikan",
    "system": "Sarjana Sistem Informasi (IPK 3,632/4,0)",
    "year": "06/2016 - 12/2020",
    "university": "Universitas Surabaya (UBAYA)",
    "prof_experience": "Pengalaman Profesional",
    "fullstack_dev": "Full-Stack Developer",
    "software_engineer": "Software Engineer",
    "software_backend_dev": "Pengembang Backend",
    "mobile_app_freelance": "Freelancer Aplikasi Mobile",
    "software_house": "Software House",
    "content_work_4": [
      "Memigrasikan codebase kustom dari Aquila ke Laravel, mempermudah kurva belajar bagi developer baru.",
      "Meninjau dan mengoptimalkan kode rekan tim untuk menjaga standar kualitas serta memastikan solusi yang mudah dirawat dan berperforma baik.",
      "Mengembangkan paket Composer kustom untuk memusatkan fungsi bersama dan standar, mengurangi duplikasi kode dan mempercepat delivery fitur di proyek serupa."
    ],
    "content_work_3": [
      "Mengembangkan aplikasi pemantauan pesanan untuk pemilik bisnis menggunakan Flutter, meningkatkan pelacakan penjualan dan insight pelanggan secara real-time. Aplikasi ini mengonsumsi API yang disediakan tim lain.",
      "Mengintegrasikan fitur geolokasi sehingga bisnis dapat memvisualisasikan sebaran pelanggan lewat peta interaktif; memudahkan pengguna mengidentifikasi siapa yang menggunakan produk.",
      "Mengoptimalkan manajemen pesanan dengan sistem status terkategori (pending, processing, shipped, received) sehingga mengurangi inefisiensi operasional.",
      "Membangun sistem leaderboard dinamis untuk melacak produk, pelanggan, dan karyawan dengan performa terbaik, mendorong engagement dan analisis kinerja."
    ],
    "content_work_2": [
      "Merilis beberapa situs e-commerce, berkolaborasi dengan senior untuk mengimplementasikan dan melakukan override fungsi inti platform di Magento 2.",
      "Membangun dan mengintegrasikan API GraphQL (custom queries/mutations) serta mengorkestrasi layanan REST/GraphQL pihak ketiga yang digunakan di storefront brand.",
      "Mendeploy tiga situs ke produksi serta menangani rilis dan pembaruan dengan lancar.",
      "Melakukan containerization layanan dengan Docker untuk standarisasi deployment, mengurangi perbedaan lingkungan dan isu deployment.",
      "Mengintegrasikan serta mengotomatiskan alur kerja end-to-end menggunakan n8n untuk orkestrasi sinkronisasi data, notifikasi, dan tugas ETL."
    ],
    "content_work_1": [
      "Berkolaborasi dengan tim engineering dan UI/UX untuk membangun alat web internal menggunakan PHP, meningkatkan efisiensi tim dan alur kerja.",
      "Mengembangkan aplikasi alur kerja kompetisi dengan Flutter."
    ]
  },
  "contact_page": {
    "contact": "Hubungi Saya",
    "description": "Jangan ragu untuk menghubungi saya untuk pertanyaan atau kolaborasi.",
    "address": "Alamat",
    "whatsapp": "Nomor WhatsApp",
    "email_me": "Kirim Email"
  },
  "portfolio_page": {
    "all": "Semua",
    "mobile_app": "Aplikasi Mobile",
    "web_app": "Aplikasi Web",
    "data_science": "Data Science",
    "portfolio": "Portofolio",
    "more_details": "Lihat Detail",
    "description": "Ini adalah portofolio Danny Alfandi yang memuat pekerjaan sebelumnya, proyek freelance, serta proyek/kelas pribadi. Anda dapat melihat detailnya dengan mengeklik ikon tautan saat kursor diarahkan ke gambar."
  },
  "detail_portfolio_page": {
    "portfolio_details": "Detail Portofolio",
    "project_information": "Informasi Proyek",
    "category": "Kategori",
    "client": "Klien",
    "project_date": "Tanggal Proyek"
  }
}