{
  "site": {
    "title": "Portofolio Danny"
  },
  "nav": {
    "home": "Beranda",
    "about": "Tentang",
    "resume": "Resume",
    "portfolio": "Portofolio",
    "contact": "Kontak"
  },
  "footer_template":{
    "copyright": "© Hak Cipta Danny Alfandi. Seluruh hak dilindungi.",
    "designed": "Dirancang oleh ",
    "bootstrap_made": "BootstrapMade.",
    "distributed": "Didistribusikan oleh ",
    "theme_wagon": "ThemeWagon."
  },
  "home_page": {
    "description": "Dia adalah pengembang backend/full-stack.",
    "about_me": "Profil Saya"
  },
  "about_page": {
      "about": "Tentang",
      "content_about_1": "Danny adalah Full-Stack Engineer dengan pengalaman lebih dari 3 tahun dalam merancang dan membangun layanan backend serta aplikasi mobile.",
      "content_about_2": "Ia lulus dari Universitas Surabaya (UBAYA) pada 2020 dan memulai karier di industri software house. Pertama kali bekerja sebagai Software Developer di Hiro Solutions. Setelah itu, ia melanjutkan sebagai Backend Developer di salah satu agensi digital terkemuka dan partner Magento global, ICUBE by SIRCLO di Jakarta, pada pertengahan 2021 dan menangani banyak brand. Terakhir, ia bekerja sebagai Full-Stack Developer di PT Inaugurasi Pelangi Nusantara di Surabaya.",
      "content_about_3": "Ia memulai perjalanan ini pada 2020 dan terus meningkatkan keterampilannya untuk menghadirkan produk nyata.",
      "role": "Pengembang Perangkat Lunak",
      "bio": "Biodata",
      "phone": "Telepon",
      "email": "Email",
      "freelance": "Freelance",
      "status_work": "Tersedia",
      "city": "Kota",
      "location": "Surabaya, Jawa Timur",
      "degree": "Gelar",
      "status_degree": "Gelar Sarjana",
      "skills": "Keahlian",
      "content_skills": "Berikut soft skill dan hard skill yang saya miliki."
    },
    "location": {
      "surabaya": "Surabaya, Jawa Timur",
      "tangerang": "Tangerang",
      "jakarta": "Jakarta",
      "indonesia": "Indonesia",
      "remote": "Jarak Jauh"
    },
    "resume_page": {
      "resume": "Resume",
      "content_resume": "Software Developer dengan pengalaman luas dalam pengembangan full-stack dan backend, dengan spesialisasi pada Laravel, Magento 2, dan Flutter. Berhasil mengoptimalkan basis kode dan menerapkan lingkungan terkontainerisasi, menghasilkan peningkatan efisiensi operasional. Berkomitmen untuk memanfaatkan wawasan berbasis data dalam mengembangkan solusi perangkat lunak yang berdampak. Terbuka untuk peluang di bidang Full-Stack Development dengan fokus pada transisi ke Data Science.",
      "education": "Pendidikan",
      "system": "Sarjana Sistem Informasi (IPK 3.632/4.0)",
      "year": "06/2016 - 01/2021",
      "university": "Universitas Surabaya (UBAYA)",
      "prof_experience": "Pengalaman Profesional",
      "fullstack_dev": "Fullstack Developer",
      "software_engineer": "Software Engineer",
      "software_backend_dev": "Software Backend Developer",
      "mobile_app_freelance": "Freelancer Aplikasi Mobile",
      "software_house": "Software House",
      "content_work_4": [
        "Memigrasikan dan mengoptimalkan kode warisan ke Laravel, meningkatkan kemudahan pemeliharaan dan mengurangi waktu onboarding sebesar 20%.",
        "Merombak kode tim menggunakan alat profiling dan arsitektur bersih, menghasilkan pengurangan 10% pada code smells.",
        "Mengembangkan paket Composer yang dapat digunakan kembali untuk logika bisnis bersama, menghilangkan duplikasi kode dan mempercepat pengiriman fitur.",
        "Menerapkan teknik optimasi sistem data untuk mempercepat eksekusi query dan caching, meningkatkan waktu respons serta mengurangi penggunaan sumber daya server."
      ],
      "content_work_3": [
        "Mengembangkan aplikasi pemantauan pesanan mobile menggunakan Flutter untuk meningkatkan pelacakan penjualan secara real-time.",
        "Mengintegrasikan fitur geolokasi untuk memvisualisasikan distribusi pelanggan melalui peta interaktif.",
        "Menerapkan sistem status yang sistematis untuk manajemen pesanan, mengurangi ketidakefisienan operasional.",
        "Membuat sistem leaderboard dinamis untuk mengidentifikasi produk dan pelanggan dengan performa tinggi."
      ],
      "content_work_2": [
        "Meluncurkan beberapa platform e-commerce menggunakan Magento 2, menyederhanakan fungsi inti storefront.",
        "Mengoptimalkan GraphQL API untuk meningkatkan efisiensi pengambilan data, mengurangi permintaan sisi klien sebesar 25%.",
        "Menyebarkan tiga situs produksi tanpa masalah kritis pasca-peluncuran, memastikan peningkatan versi berjalan mulus.",
        "Mengkonteinerisasi komponen layanan dengan Docker untuk menstandarisasi lingkungan dan meminimalkan inkonsistensi deployment.",
        "Mengintegrasikan dan mengotomatisasi proses ujung ke ujung menggunakan n8n untuk sinkronisasi data otomatis."
      ],
      "content_work_1": [
        "Berkolaborasi dengan tim engineering dan UI/UX untuk mengembangkan aplikasi web internal menggunakan PHP.",
        "Merancang aplikasi mobile untuk alur kerja kompetisi menggunakan Flutter.",
        "Meningkatkan produktivitas tim dan menyederhanakan proses melalui kolaborasi yang efektif."
      ]
  },
  "contact_page": {
    "contact": "Hubungi Saya",
    "description": "Jangan ragu untuk menghubungi saya untuk pertanyaan atau kolaborasi.",
    "address": "Alamat",
    "whatsapp": "Nomor WhatsApp",
    "email_me": "Kirim Email"
  },
  "portfolio_page": {
    "all": "Semua",
    "mobile_app": "Aplikasi Mobile",
    "web_app": "Aplikasi Web",
    "data_science": "Data Science",
    "portfolio": "Portofolio",
    "more_details": "Lihat Detail",
    "description": "Ini adalah portofolio Danny Alfandi yang memuat pekerjaan sebelumnya, proyek freelance, serta proyek/kelas pribadi. Anda dapat melihat detailnya dengan mengeklik ikon tautan saat kursor diarahkan ke gambar."
  },
  "detail_portfolio_page": {
    "portfolio_details": "Detail Portofolio",
    "project_information": "Informasi Proyek",
    "category": "Kategori",
    "client": "Klien",
    "project_date": "Tanggal Proyek",
    "description": "Deskripsi",
    "specification": "Spesifikasi"
  }
}