{
  "site": {
    "title": "Portofolio Danny"
  },
  "nav": {
    "home": "Beranda",
    "about": "Tentang",
    "resume": "Resume",
    "portfolio": "Portofolio",
    "contact": "Kontak"
  },
  "footer_template":{
    "copyright": "© Hak Cipta Danny Alfandi. Seluruh hak dilindungi.",
    "designed": "Dirancang oleh ",
    "bootstrap_made": "BootstrapMade.",
    "distributed": "Didistribusikan oleh ",
    "theme_wagon": "ThemeWagon."
  },
  "home_page": {
    "description": "Dia adalah pengembang backend/full-stack.",
    "about_me": "Profil Saya"
  },
  "about_page": {
      "about": "Tentang",
      "content_about_1": "Danny adalah Full-Stack Engineer dengan pengalaman lebih dari 3 tahun dalam merancang dan membangun layanan backend serta aplikasi mobile.",
      "content_about_2": "Ia lulus dari Universitas Surabaya (UBAYA) pada 2020 dan memulai karier di industri software house. Pertama kali bekerja sebagai Software Developer di Hiro Solutions. Setelah itu, ia melanjutkan sebagai Backend Developer di salah satu agensi digital terkemuka dan partner Magento global, ICUBE by SIRCLO di Jakarta, pada pertengahan 2021 dan menangani banyak brand. Terakhir, ia bekerja sebagai Full-Stack Developer di PT Inaugurasi Pelangi Nusantara di Surabaya.",
      "content_about_3": "Ia memulai perjalanan ini pada 2020 dan terus meningkatkan keterampilannya untuk menghadirkan produk nyata.",
      "role": "Pengembang Perangkat Lunak",
      "bio": "Biodata",
      "phone": "Telepon",
      "email": "Email",
      "freelance": "Freelance",
      "status_work": "Tersedia",
      "city": "Kota",
      "location": "Surabaya, Jawa Timur",
      "degree": "Gelar",
      "status_degree": "Gelar Sarjana",
      "skills": "Keahlian",
      "content_skills": "Berikut soft skill dan hard skill yang saya miliki."
    },
    "location": {
      "surabaya": "Surabaya, Jawa Timur",
      "tangerang": "Tangerang",
      "jakarta": "Jakarta",
      "indonesia": "Indonesia",
      "remote": "Jarak Jauh"
    },
    "resume_page": {
      "resume": "Resume",
      "content_resume": "Software Developer dengan pengalaman lebih dari 3 tahun di pengembangan full-stack dan backend. Meningkatkan performa codebase, memastikan maintainability, serta menerapkan lingkungan terkontainer untuk efisiensi operasional yang lebih baik. Menguasai PHP (Laravel), JavaScript (Node.js, GraphQL), Flutter, serta alat DevOps (Docker dan Git). Terbukti menghadirkan solusi optimal yang meningkatkan pengalaman pengguna dan efisiensi operasional dengan dampak terukur.",
      "education": "Pendidikan",
      "system": "Gelar Sarjana Sistem Informasi (IPK 3,632/4,0)",
      "year": "06/2016 - 12/2020",
      "university": "Universitas Surabaya (UBAYA)",
      "prof_experience": "Pengalaman Profesional",
      "fullstack_dev": "Fullstack Developer",
      "software_engineer": "Software Engineer",
      "software_backend_dev": "Software Backend Developer",
      "mobile_app_freelance": "Freelancer Aplikasi Mobile",
      "software_house": "Software House",
      "content_work_4": [
        "Memigrasikan codebase Aquila ke Laravel untuk mempermudah kurva belajar developer baru.",
        "Meninjau dan mengoptimalkan kode rekan tim guna menjaga standar kualitas dan menyediakan solusi yang mudah dirawat serta efisien.",
        "Mengembangkan paket Composer kustom untuk memusatkan fungsi umum dan praktik terbaik, menghilangkan duplikasi kode dan mempercepat delivery fitur pada proyek serupa."
      ],
      "content_work_3": [
        "Mengembangkan aplikasi pemantauan pesanan mobile untuk pemilik bisnis menggunakan Flutter, meningkatkan pelacakan penjualan dan insight pelanggan secara real-time. Aplikasi ini memanfaatkan API yang diekspos tim lain.",
        "Mengintegrasikan fitur geolokasi yang memungkinkan perusahaan memetakan sebaran pelanggan melalui peta interaktif. Fitur ini membantu pengguna melihat siapa yang menggunakan produk.",
        "Mengoptimalkan manajemen pesanan dengan sistem status yang terstruktur (pending, processing, shipped, received) sehingga mengurangi inefisiensi operasional.",
        "Membangun sistem leaderboard dinamis untuk melacak produk, pelanggan, dan karyawan berperforma tinggi guna memaksimalkan engagement dan metrik kinerja."
      ],
      "content_work_2": [
        "Merilis sejumlah situs e-commerce produksi dan rilisnya; berkolaborasi dengan senior untuk mengimplementasikan dan meng-override fungsi inti platform di Magento 2.",
        "Mengembangkan dan mengintegrasikan API GraphQL (custom query/mutation) serta mengelola layanan REST/GraphQL pihak ketiga yang digunakan oleh storefront brand.",
        "Merilis tiga situs ke produksi, memastikan deployment tepat waktu, dukungan pasca-rilis yang efisien, dan pembaruan versi yang mulus.",
        "Melakukan containerization layanan berbasis Docker untuk standarisasi deployment, mengurangi pergeseran lingkungan, dan meminimalkan isu deployment.",
        "Mengintegrasikan dan mengotomatisasi alur kerja end-to-end dengan n8n untuk sinkronisasi data, notifikasi, dan proses ETL."
      ],
      "content_work_1": [
        "Berkolaborasi dengan tim engineering dan UI/UX dalam mengembangkan aplikasi web internal menggunakan PHP, sehingga produktivitas tim meningkat dan proses menjadi lebih ringkas.",
        "Mengembangkan aplikasi mobile alur kerja kompetisi dengan Flutter."
      ]
  },
  "contact_page": {
    "contact": "Hubungi Saya",
    "description": "Jangan ragu untuk menghubungi saya untuk pertanyaan atau kolaborasi.",
    "address": "Alamat",
    "whatsapp": "Nomor WhatsApp",
    "email_me": "Kirim Email"
  },
  "portfolio_page": {
    "all": "Semua",
    "mobile_app": "Aplikasi Mobile",
    "web_app": "Aplikasi Web",
    "data_science": "Data Science",
    "portfolio": "Portofolio",
    "more_details": "Lihat Detail",
    "description": "Ini adalah portofolio Danny Alfandi yang memuat pekerjaan sebelumnya, proyek freelance, serta proyek/kelas pribadi. Anda dapat melihat detailnya dengan mengeklik ikon tautan saat kursor diarahkan ke gambar."
  },
  "detail_portfolio_page": {
    "portfolio_details": "Detail Portofolio",
    "project_information": "Informasi Proyek",
    "category": "Kategori",
    "client": "Klien",
    "project_date": "Tanggal Proyek",
    "description": "Deskripsi",
    "specification": "Spesifikasi"
  }
}